app/controllers/api/v1/users_controller.rb

  def show
    user = nil
    response = nil

    # checks the parameter is a valid eth address
    params_address = Eth::Address.new params[:id]
    if params_address.valid?

      # finds user by valid eth address (downcase to prevent checksum mismatches)
      user = User.find_by(eth_address: params[:id].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."eth_address" = ? LIMIT ?  [["eth_address", "0x00ec3157ee6e44f0223b8385ab7b2938e9b36ab2"], ["LIMIT", 1]]