app/controllers/users_controller.rb

  def create

    # create new user from allowed params
    @user = User.new(user_params)

    # only proceed with pretty names
    if @user and @user.username and @user.username.size > 0

      # create randome nonce
      @user.eth_nonce = SecureRandom.uuid

      # usually, we want to let the user sign the nonce to make sure
      # they are authorized to create a new user account for the
      # given CELO address. for the demo, we skip this for the
      # sake of keeping it simple.

      # only proceed with eth address
      if @user.eth_address

        # make sure the eth address is valid
        address = Eth::Address.new @user.eth_address
        if address.valid?

          # save to database
          if @user.save
---
INSERT INTO "users" ("username", "eth_address", "eth_nonce", "created_at", "updated_at", "email", "views", "first_name", "second_name", "last_name", "second_last", "type_document", "cellphone", "no_document", "genero", "birthdate", "permission_level") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)